#### Cluster ☸️ `Development`

#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```[command]/home/runner/work/_temp/f92a9721-ebb1-487c-9eec-0b18a85fd56d/terraform-bin show -no-color tfplan

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # kubernetes_secret.cert_manager_cf[0] will be created
  + resource "kubernetes_secret" "cert_manager_cf" {
      + data = (sensitive value)
      + id   = (known after apply)
      + type = "Opaque"

      + metadata {
          + generation       = (known after apply)
          + name             = "cloudflare-api-token-secret"
          + namespace        = "cert-manager"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ client_token = (sensitive value)
::debug::Terraform exited with code 0.
::debug::stdout: %0AAn execution plan has been generated and is shown below.%0AResource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # kubernetes_secret.cert_manager_cf[0] will be created%0A  + resource "kubernetes_secret" "cert_manager_cf" {%0A      + data = (sensitive value)%0A      + id   = (known after apply)%0A      + type = "Opaque"%0A%0A      + metadata {%0A          + generation       = (known after apply)%0A          + name             = "cloudflare-api-token-secret"%0A          + namespace        = "cert-manager"%0A          + resource_version = (known after apply)%0A          + self_link        = (known after apply)%0A          + uid              = (known after apply)%0A        }%0A    }%0A%0APlan: 1 to add, 0 to change, 0 to destroy.%0A%0AChanges to Outputs:%0A  ~ client_token = (sensitive value)%0A
::debug::stderr: 
::debug::exitcode: 0
::set-output name=stdout::%0AAn execution plan has been generated and is shown below.%0AResource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # kubernetes_secret.cert_manager_cf[0] will be created%0A  + resource "kubernetes_secret" "cert_manager_cf" {%0A      + data = (sensitive value)%0A      + id   = (known after apply)%0A      + type = "Opaque"%0A%0A      + metadata {%0A          + generation       = (known after apply)%0A          + name             = "cloudflare-api-token-secret"%0A          + namespace        = "cert-manager"%0A          + resource_version = (known after apply)%0A          + self_link        = (known after apply)%0A          + uid              = (known after apply)%0A        }%0A    }%0A%0APlan: 1 to add, 0 to change, 0 to destroy.%0A%0AChanges to Outputs:%0A  ~ client_token = (sensitive value)%0A
::set-output name=stderr::
::set-output name=exitcode::0
```

</details>

*Pusher: @kupson, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform`*